load-tests/loadtestDocumentsPage.yml
version: "1.1"
name: loadTest
env:
  host: chelzoo.ru # Домен, куда полетят ваши запросы

config:
  loadTest:
    exec:
      env: ${{env}}
      tests:
        - custom
    
    phases:
      - duration: 60 # Время выполнения теста в секундах
        arrivalRate: 10 # Количество запросов в секунду (RPS - Requests Per Second)

tests:
  custom:
    steps:
      - name: GET Home Page
        http:
          url: https://${{env.host}}/documents # Ссылка куда будут отправляться запросы (env.host задается в самом начале файла), можно дописать /news, /discounts и так далее
          method: GET
          timeout: 10000 # Таймаут на 1 запрос в миллисекундах
          headers:
            User-Agent: "LoadTestBot"
    checks:
      - metric: http.response_time
        max: 2000    # Макс. время ответа (ms)